//
//  main.cpp
//  案例C++管理系统
//
//  Created by Mac on 16/6/6.
//  Copyright © 2016年 Mac. All rights reserved.
//

#include <iostream>


//一个小型公司的人员信息“理系统
//某小型公司%主要有四类人员3 经理、技术人员、销售经理和推销员。现在% 需要存储这些人员的姓名、编号、级别、当月薪水'计算月薪总额并显示全部信 息。
//人员编号基数为 1000%每输入一个人员信息编号顺序加 1。
//程序要有对所有人员提升级别的功能。本例中为简单起见%所有人员的初 始级 别均为 1 级。然后进行升级%经理升为 4 级%技术人员和销售经理升为 3 级% 推销 员仍为1级。
//月薪计算办法是3 经理拿固定月薪 8000 元4技术人员按每小时 100 元领取 月 薪4 推销员的月薪按该推销员当月销售额的 4%提成4销售经理既拿固定月薪 也 领取销售提成%固定月薪为 5000 元%销售提成为所“辖部门当月销售总额的 5%。



int main(int argc, const char * argv[])
{


    std::cout << "Hello, World!\n";
    return 0;
}
